<script lang="ts">
    import * as bootstrap from "bootstrap";
    let modalEl;
    export function show() {
        bootstrap.Modal.getOrCreateInstance(modalEl).show();
    }
</script>

<div class="modal fade" id="aboutModal" tabindex="-1" aria-hidden="true" bind:this={modalEl}>
    <div class="modal-dialog modal-lg modal-dialog-centered modal-fullscreen-lg-down">
        <div class="modal-content">
            <div class="modal-header">
                <h5 class="modal-title" id="addStemmaLabel">О проекте</h5>
                <button type="button" class="btn-close" data-bs-dismiss="modal" aria-label="Close" />
            </div>
            <div class="modal-body">
                <img src="assets/logo_color.webp" alt="" width="100" height="100" class="mx-auto d-block" />

                <div class="mt-4">
                    <h6>Stemma</h6>
                    <p>
                        Stemma - некомерческий проект, который начался с попытки собрать и систематизировать большое генеалогическое дерево. Довольно скоро
                        выяснилось, что в одиночку собирать информацию о дальних родственниках сложно, поэтому мы решили дать возможность редактировать древо
                        всем вместе.
                    </p>
                </div>

                <div class="mt-4">
                    <h6>Семья и правила построения древа</h6>
                    <p>
                        Родословная - это набор семей и связей между ними. Семья состоит из детей и родителей, и состоит как минимум из двух человек, она
                        обозначается небольшим кругом. Отношения в семье показаны направленными стрелками разной толщины. Стрелка, направленная от человека к
                        семье показывает отношение "родитель" или "брак", а стрелка, направленная из семьи к человеку описывает отношение "ребенок".
                    </p>
                    <p>При добавлении семьи нужно учитывать несколько правил, которые система автоматически проверяет:</p>
                    <ul>
                        <li>Семья состоит из родителей и детей</li>
                        <li>Нельзя создать семью, состоящую из одного человека</li>
                        <li>Можно создать семью без родителей, можно создать семью без детей, главное, чтобы в ней было минимум два человека</li>
                        <li>Не может быть больше двух родителей, тогда как количество детей неограничено</li>
                        <li>
                            Если у указанных родителей уже есть дети, то вместо создания новой семьи будет обновлена существующая, а списки детей объеденины
                        </li>
                        <li>Удаление семьи не удаляет членов этой семьи, а разрывает связи между ними</li>
                        <li>Родитель может иметь несколько браков-семей, но у детей не может быть родителей из разных браков</li>
                        <li>
                            Нельзя создать циклическую зависимость в древе, другими словами нельзя выбрать кого-то из своих родственников, сколь угодно дальних,
                            в качестве супруга
                        </li>
                        <li>
                            Система проверяет права на редактирование информации о том или ином человеке, и при создании семьи не позволит использовать людей,
                            редактирование которых запрещено
                        </li>
                    </ul>
                </div>

                <div class="mt-4">
                    <h6>Могут быть тезки</h6>
                    <p>
                        При создании семьи необходимо учитывать, что система может уже содержать человека с указанным именем - тезку. В таком случае вы должны
                        уточнить, хотите ли вы создать нового человека-тезку, или же добавить уже существующему человеку дополнительные родственные связи.
                    </p>
                </div>
                <div class="mt-4">
                    <h6>Делитесь родословной</h6>
                    <p>
                        Вам доступно создание неограниченного числа родословных. Вы можете создать родословную "с нуля", а можете скопировать уже существующую.
                        В обоих случаях у вас будет права на редактирование всех членов родословной
                    </p>
                    <p>
                        Вы так же можете пригласить других пользователей в существующую родословную. В этом случае, вы дадите приглашенным права на изменение
                        информации об их кровных родственниках и их супругах. Вы не сможете редактировать информацию о людях, созданных приглашенными
                        пользователями. Чтобы пригласить пользователя, создайте для него персональную ссылку-приглашение. Соответсвующие права будут даны как
                        только пользователь перейдет по ней.
                    </p>
                    <p>
                        <b>Внимание</b>, аутентификация в системе возможна только с помощью google-аккаунта. Это значит, что для приглашения пользователя
                        необходимо указывать его email, ассоциированный с google-аккаунтом. Обычно, это gmail-почта, которая заканчивается на <i>@gmail.com</i>
                    </p>
                </div>
                <div class="mt-4">
                    <h6>Возникли проблемы?</h6>
                    <p>
                        Такое бывает, не расстраивайтесь. Можете задать вопрос, пожаловаться, или наоборот, похвалить нас, написав на <a
                            href="mailto:danilasergeevich@gmail.com?subject=stemma">почту</a
                        >.
                    </p>
                </div>
            </div>
            <div class="modal-footer">
                <button type="button" class="btn btn-secondary" data-bs-dismiss="modal">Понятно</button>
            </div>
        </div>
    </div>
</div>
